# Используем официальный образ Golang в качестве базового образа
FROM golang:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем содержимое текущего каталога (где находится Dockerfile) внутрь контейнера в /app
COPY . .

# Собираем приложение, используя go get (это может понадобиться, если ваш проект зависит от сторонних пакетов)
# RUN go get -d -v ./...

# Собираем само приложение
RUN go build -o main ./cmd/api

# Экспортируем порт 8080, который ваше приложение будет слушать
EXPOSE 8080

# Запускаем приложение при старте контейнера
CMD ["./main"]
